Revit 2027 API
DuctFittingAndAccessoryConnectorData Class
 The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctFittingAndAccessoryConnectorData : IDisposable
Public Class DuctFittingAndAccessoryConnectorData
	Implements IDisposable
public ref class DuctFittingAndAccessoryConnectorData : IDisposable
type DuctFittingAndAccessoryConnectorData =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryConnectorData type exposes the following members.
Properties
Name | Description
Angle |  the angle of the fitting, Units:(rad).
Diameter |  The connector diameter, Units:(ft).
Flow |  The connector flow, Units:(ft³/s)
FlowDirection |  the flow direction of this connector, In or Out.
Height |  The connector height, Units:(ft).
Index |  return the index of this connector
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LinkIndex |  the index of the connector which is linked with this connector
Profile |  The connector profile.
VelocityPressure |  The connector velocity pressure. Units: (kg/(ft·s²)).
Width |  The connector width, Units:(ft).
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryConnectorData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCoordination |  Gets the coordination of the connector
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace